---
kind: type
id: T:Autodesk.Revit.DB.DetailNurbSpline
source: html/781d3dfc-f287-470d-4e42-059202304cd2.htm
---
# Autodesk.Revit.DB.DetailNurbSpline

Represents a DetailNurbSpline within Autodesk Revit.

## Syntax (C#)
```csharp
public class DetailNurbSpline : DetailCurve
```

## Remarks
Currently it's just a place holder for specific type.
All the geometry-related functionality is provided by geometry curve object from
DetailCurve::geometryCurve property.